УРВ_файловая/src/InformationRegisters/ПользователиПриложений/ПользователиПриложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиПриложений</name>
  <resources>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </resources>
  <resources>
    <name>Разрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Приложение</name>
    <type>
      <types>CatalogRef.Приложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательСервиса</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <type>
      <types>EnumRef.ПраваПользователейПриложений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/ПользователиПриложений/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
	Если Не ЗначениеЗаполнено(Запись.Сервис) Тогда
		Если ЗначениеЗаполнено(Запись.ПользовательСервиса) Тогда
			Запись.Сервис = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ПользовательСервиса,"Владелец");
		ИначеЕсли ЗначениеЗаполнено(Запись.Приложение) Тогда
			Запись.Сервис = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Приложение,"Владелец");
		КонецЕсли;  
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
